snlkuharlocal/src/DataProcessors/РассылкаОшибокИзЛогов/РассылкаОшибокИзЛогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РассылкаОшибокИзЛогов</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОшибкиПроверкиКМвЧЗ/ОшибкиПроверкиКМвЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиПроверкиКМвЧЗ</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМ</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекстКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОшибкиПроверкиКМвРеестре/ОшибкиПроверкиКМвРеестре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиПроверкиКМвРеестре</name>
  <attributes>
    <name>ОшибочнаяНакладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравильныйДокумент</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравильнаяНакладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОшибочныйДокумент</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/РассылкиЭлПочта/РассылкиЭлПочта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РассылкиЭлПочта</name>
  <attributes>
    <name>ОбъектРассылки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.ШтрихКоды</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРассылки</name>
    <type>
      <types>CatalogRef.ТипыРассылок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиУведомлений</name>
    <attributes>
      <name>СкладИОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>EMail</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/РассылкаОшибокИзЛогов/ObjectModule.bsl
Перем ИмяЛогаРассылок;

Функция ПолучитьПараметры() Экспорт
	тПараметры = Новый ТаблицаЗначений;
	
	тПараметры.Колонки.Добавить("Имя");
	тПараметры.Колонки.Добавить("Значение");
	тПараметры.Колонки.Добавить("Комментарий");
	
	
	СтрокаТП = тПараметры.Добавить();
	
	СтрокаТП.Имя			= "ИмяЛога";
	СтрокаТП.Значение		= "";
	СтрокаТП.Комментарий	= "Имя лога (необязательно)";
	
	
	СтрокаТП = тПараметры.Добавить();
	
	СтрокаТП.Имя			= "МинДатаЗаписиЛога";
	СтрокаТП.Значение		= НачалоДня(ТекущаяДата());
	СтрокаТП.Комментарий	= "Начало сканирования логов";
	
	
	СтрокаТП = тПараметры.Добавить();
	
	СтрокаТП.Имя			= "Интервал";
	СтрокаТП.Значение		= 15;
	СтрокаТП.Комментарий	= "Интервал обработки сообщений лога (в минутах)";	
	
	Возврат тПараметры;
КонецФункции //ПолучитьПараметры() Экспорт

Функция Сформировать(тПараметры = Неопределено) Экспорт	
	Если ТипЗнч(тПараметры) = Тип("ТаблицаЗначений") Тогда
		пОбработки = ТаблицаПараметровВСоответствие(тПараметры);
	Иначе                                              
		пОбработки = тПараметры;
	КонецЕсли;	
	
	ВыполнитьРассылки(пОбработки);
КонецФункции //Сформировать(тПараметры = Неопределено)

Функция ТаблицаПараметровВСоответствие(тПараметры)
	Результат = Новый Соответствие;
	Для каждого СтрокаП Из тПараметры Цикл		
		ТекЗнач = Результат[СтрокаП.Имя];
		Если ТекЗнач = Неопределено Тогда
			ТекЗнач = СтрокаП.Значение;
		Иначе			
			Если ТипЗнч(ТекЗнач) = Тип("Массив") Тогда
				ТекЗнач.Добавить(СтрокаП.Значение);
			Иначе
				ВремЗнач = ТекЗнач;
				ТекЗнач = Новый Массив;
				ТекЗнач.Добавить(ВремЗнач);
				ТекЗнач.Добавить(СтрокаП.Значение);
			КонецЕсли;			
		КонецЕсли;			
		Результат[СтрокаП.Имя] = ТекЗнач;
	КонецЦикла;
	Возврат Результат;
КонецФункции //ТаблицаПараметровВСоответствие()()

Функция ВыполнитьРассылки(Знач пОбработки = Неопределено) Экспорт
	ЗаписатьВЛог(ИмяЛогаРассылок, "Начало обработки", "Информация");
	
	Если пОбработки = Неопределено Тогда
		пОбработки = Новый Структура;	
	КонецЕсли;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для каждого пРассылки Из ПолучитьСписокРассылок(пОбработки) Цикл
		пОбработки.Вставить("Рассылка", пРассылки.Рассылка);		
		ОбработатьЛог(пРассылки.ИмяЛога, пОбработки);
	КонецЦикла;	
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	ЗаписатьВЛог(ИмяЛогаРассылок, "Завершение обработки", "Информация", , , Время);
КонецФункции

Функция ПолучитьСписокРассылок(пОбработки = Неопределено)
	Результат	= Новый Массив;
	
	ИмяЛога		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяЛога",	"");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка			КАК Рассылка,
	|	Наименование
	|ИЗ
	|	Справочник.РассылкиЭлПочта
	|ГДЕ
	|	Наименование ПОДОБНО ""Ошибки в логе %""
	|	И НЕ ПометкаУдаления 
	|";                           
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Поз = СтрНайти(Выборка.Наименование, "'");
		Если Поз = 0 Тогда                        
			Поз = СтрНайти(Выборка.Наименование, """");
		КонецЕсли;
		Если Поз > 0 Тогда
			ТекИмяЛога	= СокрЛП(Сред(Выборка.Наименование, Поз+1));
			ТекИмяЛога	= СтрЗаменить(ТекИмяЛога, """", "");
			ТекИмяЛога	= СтрЗаменить(ТекИмяЛога, "'", "");
			
			Если ЗначениеЗаполнено(ТекИмяЛога) Тогда
				Если ПустаяСтрока(ИмяЛога) ИЛИ СтрНайти(ИмяЛога, ТекИмяЛога) > 0 Тогда				
					Результат.Добавить(Новый Структура("ИмяЛога,Рассылка", ТекИмяЛога, Выборка.Рассылка));
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьСписокРассылок()

Функция ПолучитьАдресатов(Рассылка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	EMail
	|ИЗ
	|	Справочник.РассылкиЭлПочта.ПолучателиУведомлений
	|ГДЕ
	|	Ссылка = &Рассылка	              
	|УПОРЯДОЧИТЬ ПО
	|	EMail
	|";
	
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	
	мПолучателей = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мПолучателей.Добавить(СокрЛП(Выборка.EMail));	
	КонецЦикла;
	
	Возврат мПолучателей;
КонецФункции //ПолучитьАдресатов(Рассылка)

Функция ОбработатьЛог(ИмяЛога, пОбработки = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ИмяЛога) Тогда Возврат Ложь КонецЕсли;
	
	Рассылка		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Рассылка");
	ПериодС			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "МинДатаЗаписиЛога", 	НачалоДня(ТекущаяДата()));
	Интервал_Минут	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Интервал",			15);	
	
	Интервал_Секунд	= Интервал_Минут * 60;
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаСозданияПисьма,
	|	Основание
	|ИЗ
	|	РегистрСведений.ПисьмаНаОтправку
	|ГДЕ
	|	Основание ПОДОБНО ""Ошибки в логе '" + ИмяЛога + "'%""
	|	ИЛИ Основание ПОДОБНО ""Ошибок в логе '" + ИмяЛога + "'%""
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСозданияПисьма УБЫВ
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДатаСозданияПисьма) Тогда
		ПериодС = Выборка.ДатаСозданияПисьма + 1;
	КонецЕсли;                                   
	
	НомерИнтервала = Цел((ТекущаяДата() - НачалоДня(ТекущаяДата())) / Интервал_Секунд);	
	
	ПериодПо = НачалоДня(ТекущаяДата()) + НомерИнтервала * Интервал_Секунд;
	Если ПериодПо >= ПериодС Тогда
		ТекстСообщения = СтрШаблон("Обработка лога: '%1', интервал: с %2 по %3.", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
		ЗаписатьВЛог(ИмяЛогаРассылок, ТекстСообщения, "Информация");	
		
		Если ПериодПо > ПериодС Тогда     
			Если СтрНачинаетсяС(ИмяЛога, "Проверка КМ") Тогда
				СоздатьПисьмоОбОшибкахКМ(ИмяЛога, ПериодС, ПериодПо, Рассылка);
			Иначе				
				СоздатьПисьмоОбОшибках(ИмяЛога, ПериодС, ПериодПо, Рассылка);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции //ОбработатьЛог(ИмяЛога, пОбработки = Неопределено) Экспорт

Функция СоздатьПисьмоОбОшибках(ИмяЛога, ПериодС, ПериодПо, Рассылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Дата,
	|	ПОДСТРОКА(Сообщение, 1, 1000) КАК Сообщение,
	|	Автор
	|ИЗ
	|	РегистрСведений.Логи КАК Логи
	|ГДЕ
	|	Дата МЕЖДУ &ПериодС И &ПериодПо
	|	И ТипСообщения = ""Ошибка""
	|	И ИмяЛога = &ИмяЛога
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|";
	
	Запрос.Параметры.Вставить("ПериодС", 	ПериодС);
	Запрос.Параметры.Вставить("ПериодПо",	ПериодПо);
	
	Запрос.Параметры.Вставить("ИмяЛога",	ИмяЛога);
	
	Макет = ПолучитьМакет("РеестрОшибок");
	ТД = Новый ТабличныйДокумент;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат ТД;	
	КонецЕсли; 
	
	пШапки = Новый Структура("ИмяЛога,ПериодС,ПериодПо", ИмяЛога, ПериодС, ПериодПо);
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(пШапки);
	
	ТД.Вывести(ОблЗаголовок);    
	ТД.Вывести(Макет.ПолучитьОбласть("Шапка"));	
	
	Пока Выборка.Следующий() Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ТД.Вывести(ОблСтрока);
	КонецЦикла;	              
	
	ТД.Вывести(Макет.ПолучитьОбласть("Итого"));	
	
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;            
	
	ИмяВФ = ПолучитьИмяВременногоФайла("html");
	
	ТД.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.HTML5);	
	
	Получатели = ПолучитьАдресатов(Рассылка);
	
	Запись = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	Запись.ДатаСозданияПисьма 	= ПериодПо;
	Запись.ТемаПисьма			= СтрШаблон("Ошибки в логе '%1' за период с %2 по %3.", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
	Запись.Основание 			= Запись.ТемаПисьма;
	
	Запись.СписокПолучателей	= СтрСоединить(Получатели, "##");
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	Запись.ТекстПисьма = ПолучитьСтрокуИзДвоичныхДанных(ДД);
	
	ИмяВФ = ПолучитьИмяВременногоФайла("xlsx");
	ТД.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.XLSX);
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	
	Запись.Вложение = Новый ХранилищеЗначения(ДД, Новый СжатиеДанных(9));
	Запись.ИмяФайлаВложения = СтрШаблон("Ошибки лога %1 за период с %2 по %3.xlsx", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
	
	Запись.Записать();	
	
	Возврат ТД;
КонецФункции //СоздатьПисьмоОбОшибках(ИмяЛога, ПериодС, ПериодПо, Рассылка)

Функция СоздатьПисьмоОбОшибкахКМ(ИмяЛога, ПериодС, ПериодПо, Рассылка)	
	Получатели = ПолучитьАдресатов(Рассылка);
	
	Если Получатели.Количество() = 0 Тогда
		ЗаписатьВЛог(ИмяЛогаРассылок, СтрШаблон("Отсутствуют получатели рассылки по логу: '%1'.", ИмяЛога), "Предупреждение");
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИмяЛога = "Проверка КМ в ЧЗ" Тогда
		рПроверки = ВывестиОшибкиПроверкиКМвЧЗ(ПериодС, ПериодПо);		
	Иначе                                                  
		рПроверки = ВывестиОшибкиПроверкиКМвРеестре(ПериодС, ПериодПо);
	КонецЕсли;		
	
	ТД_Подробно = рПроверки.ТД_Подробно;
	ТД_Кратко	= рПроверки.ТД_Кратко;
	
	Если ТД_Подробно.ВысотаТаблицы = 0 Тогда
		СоздатьПисьмо_НетОшибок(ИмяЛога, ПериодС, ПериодПо, Получатели);
		Возврат ТД_Подробно;
	КонецЕсли;	            
	
	ИмяВФ = ПолучитьИмяВременногоФайла("html");
	
	ТД_Кратко.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.HTML5);	
	
	Запись = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	Запись.ДатаСозданияПисьма 	= ПериодПо;
	Запись.ТемаПисьма			= СтрШаблон("Ошибки в логе '%1' за период с %2 по %3.", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
	Запись.Основание 			= Запись.ТемаПисьма;
	
	Запись.СписокПолучателей	= СтрСоединить(Получатели, "##");
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	Запись.ТекстПисьма = ПолучитьСтрокуИзДвоичныхДанных(ДД);
	
	ИмяВФ = ПолучитьИмяВременногоФайла("xlsx");
	ТД_Подробно.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.XLSX);
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	
	Запись.Вложение = Новый ХранилищеЗначения(ДД, Новый СжатиеДанных(9));
	Запись.ИмяФайлаВложения = СтрШаблон("Ошибки лога %1 за период с %2 по %3.xlsx", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
	
	Запись.Записать();	
	
	Возврат ТД_Подробно;
КонецФункции //СоздатьПисьмоОбОшибкахКМ(ИмяЛога, ПериодС, ПериодПо, Рассылка)

Функция ВывестиОшибкиПроверкиКМвЧЗ(ПериодС, ПериодПо) Экспорт
	ИмяЛога = "Проверка КМ в ЧЗ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	Накладная.Контрагент КАК Контрагент,		
	|	*,
	|	КМ.Владелец.Наименование	КАК Номенклатура_Наименование,
	|	КМ.Владелец.Код				КАК Номенклатура_Код
	|ИЗ
	|	РегистрСведений.ОшибкиПроверкиКМвЧЗ
	|ГДЕ
	|	ДатаПроверки МЕЖДУ &ПериодС И &ПериодПо	
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПроверки
	|ИТОГИ МАКСИМУМ(Автор), МАКСИМУМ(ДатаПроверки),КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекстКМ) ПО
	|	Накладная,
	|	ДокСсылка
	|";
	
	Запрос.Параметры.Вставить("ПериодС", 	ПериодС);
	Запрос.Параметры.Вставить("ПериодПо",	ПериодПо);
	
	ТД_Подробно = Новый ТабличныйДокумент;
	ТД_Кратко	= Новый ТабличныйДокумент;
	
	Выборка_Накладная = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Накладная");
	Если Выборка_Накладная.Количество() = 0 Тогда
		Возврат Новый Структура("ТД_Подробно,ТД_Кратко", ТД_Подробно, ТД_Кратко);
	КонецЕсли;
	
	Макет = ПолучитьМакет("РеестрОшибокКМ_ЧЗ");	
	
	пШапки = Новый Структура("ИмяЛога,ПериодС,ПериодПо", ИмяЛога, ПериодС, ПериодПо);
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(пШапки);
	
	ТД_Подробно.Вывести(ОблЗаголовок);
	ТД_Кратко.Вывести(ОблЗаголовок);
	
	ТД_Подробно.Вывести(Макет.ПолучитьОбласть("Шапка"));
	ТД_Кратко.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	ТД_Подробно.НачатьАвтогруппировкуСтрок();
	ТД_Кратко.НачатьАвтогруппировкуСтрок();
	
	Выборка_Накладная = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Накладная");	
	Пока Выборка_Накладная.Следующий() Цикл		             
		ОблСтрока = Макет.ПолучитьОбласть("Накладная");
		ОблСтрока.Параметры.Заполнить(Выборка_Накладная);
		
		ТД_Подробно.Вывести(ОблСтрока, 1);
		ТД_Кратко.Вывести(ОблСтрока, 1);
			
		Выборка_ДокСсылка = Выборка_Накладная.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокСсылка");
		Пока Выборка_ДокСсылка.Следующий() Цикл
			ОблСтрока = Макет.ПолучитьОбласть("Документ");
			ОблСтрока.Параметры.Заполнить(Выборка_ДокСсылка);
			
			ТД_Подробно.Вывести(ОблСтрока, 2);
			
			Выборка = Выборка_ДокСсылка.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОблСтрока = Макет.ПолучитьОбласть("Строка");
				ОблСтрока.Параметры.Заполнить(Выборка);
				
				ТД_Подробно.Вывести(ОблСтрока, 3);
			КонецЦикла;								
		КонецЦикла;		
	КонецЦикла;	
	
	ТД_Подробно.ЗакончитьАвтогруппировкуСтрок();
	
	ТД_Подробно.Вывести(Макет.ПолучитьОбласть("Итого"));	
	
	ТД_Подробно.ОтображатьСетку		= Ложь;
	ТД_Подробно.ОтображатьЗаголовки	= Ложь;
	
	Возврат Новый Структура("ТД_Подробно,ТД_Кратко", ТД_Подробно, ТД_Кратко);
КонецФункции //ВывестиОшибкиПроверкиЧЗ(ИмяЛога, ПериодС, ПериодПо) Экспорт

Функция ВывестиОшибкиПроверкиКМвРеестре(ПериодС, ПериодПо) Экспорт
	ИмяЛога = "Проверка КМ в реестре";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ОшибочнаяНакладная.Контрагент КАК Контрагент,		
	|	ОшибочнаяНакладная КАК Накладная,
	|	ОшибочныйДокумент КАК ДокСсылка,
	|	*
	|ПОМЕСТИТЬ ВТ_ДанныеПроверки
	|ИЗ
	|	РегистрСведений.ОшибкиПроверкиКМвРеестре
	|ГДЕ
	|	ДатаПроверки МЕЖДУ &ПериодС И &ПериодПо	
	|;
	|ВЫБРАТЬ
	|	ВложенныеШтрихкоды.Штрихкод КАК ШтрихКодУпаковки
	|ПОМЕСТИТЬ ВТ_ВложенныеШтрихкоды
	|ИЗ
	|	ВТ_ДанныеПроверки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ПО
	|	ВложенныеШтрихкоды.Ссылка = ВТ_ДанныеПроверки.ШтрихКодУпаковки
	|ГДЕ
	|	ВТ_ДанныеПроверки.ШтрихКодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|;
	|ВЫБРАТЬ
	|	ВТ_ДанныеПроверки.*,
	|	ВТ_ДанныеПроверки.ШтрихКодУпаковки.Владелец.Наименование КАК Номенклатура_Наименование,
	|	ВТ_ДанныеПроверки.ШтрихКодУпаковки.Владелец.Код			 КАК Номенклатура_Код
	|ИЗ
	|	ВТ_ДанныеПроверки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_ВложенныеШтрихкоды 
	|ПО 
	|	ВТ_ВложенныеШтрихкоды.ШтрихКодУпаковки = ВТ_ДанныеПроверки.ШтрихКодУпаковки
	|ГДЕ
	|	ВТ_ВложенныеШтрихкоды.ШтрихКодУпаковки ЕСТЬ NULL 
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПроверки
	|ИТОГИ МАКСИМУМ(Автор), МАКСИМУМ(ДатаПроверки),КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеПроверки.ШтрихКодУпаковки) ПО
	|	Накладная,
	|	ДокСсылка
	|";	
		
	Запрос.Параметры.Вставить("ПериодС", 	ПериодС);
	Запрос.Параметры.Вставить("ПериодПо",	ПериодПо);
	
	ТД_Подробно = Новый ТабличныйДокумент;
	ТД_Кратко = Новый ТабличныйДокумент;
	
	Выборка_Накладная = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Накладная");
	Если Выборка_Накладная.Количество() = 0 Тогда
		Возврат Новый Структура("ТД_Подробно,ТД_Кратко", ТД_Подробно, ТД_Кратко);
	КонецЕсли;
	
	Макет = ПолучитьМакет("РеестрОшибокКМ_Реестр");	
	
	пШапки = Новый Структура("ИмяЛога,ПериодС,ПериодПо", ИмяЛога, ПериодС, ПериодПо);
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(пШапки);
	
	ТД_Подробно.Вывести(ОблЗаголовок);    
	ТД_Кратко.Вывести(ОблЗаголовок);    
	ТД_Подробно.Вывести(Макет.ПолучитьОбласть("Шапка"));
	ТД_Кратко.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	ТД_Подробно.НачатьАвтогруппировкуСтрок();
	ТД_Кратко.НачатьАвтогруппировкуСтрок();
	
	Выборка_Накладная = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Накладная");	
	Пока Выборка_Накладная.Следующий() Цикл		             
		ОблСтрока = Макет.ПолучитьОбласть("Накладная");
		ОблСтрока.Параметры.Заполнить(Выборка_Накладная);
		
		ТД_Подробно.Вывести(ОблСтрока, 1);
		ТД_Кратко.Вывести(ОблСтрока, 1);
			
		Выборка_ДокСсылка = Выборка_Накладная.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокСсылка");
		Пока Выборка_ДокСсылка.Следующий() Цикл
			ОблСтрока = Макет.ПолучитьОбласть("Документ");
			ОблСтрока.Параметры.Заполнить(Выборка_ДокСсылка);
			
			ТД_Подробно.Вывести(ОблСтрока, 2);
			
			Выборка = Выборка_ДокСсылка.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОблСтрока = Макет.ПолучитьОбласть("Строка");
				ОблСтрока.Параметры.Заполнить(Выборка);
				
				ТД_Подробно.Вывести(ОблСтрока, 3);
			КонецЦикла;								
		КонецЦикла;		
	КонецЦикла;	
	
	ТД_Подробно.ЗакончитьАвтогруппировкуСтрок();
	
	ТД_Подробно.Вывести(Макет.ПолучитьОбласть("Итого"));	
	
	ТД_Подробно.ОтображатьСетку		= Ложь;
	ТД_Подробно.ОтображатьЗаголовки	= Ложь;
	
	Возврат Новый Структура("ТД_Подробно,ТД_Кратко", ТД_Подробно, ТД_Кратко);
КонецФункции //ВывестиОшибкиПроверкиЧЗ(ИмяЛога, ПериодС, ПериодПо) Экспорт

Функция СоздатьПисьмо_НетОшибок(ИмяЛога, ПериодС, ПериодПо, Получатели)
	Запись = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	Запись.ДатаСозданияПисьма 	= ПериодПо;
	Запись.ТемаПисьма			= СтрШаблон("Ошибок в логе '%1' за период с %2 по %3 не обнаружено.", ИмяЛога, Формат(ПериодС, "ДФ='dd.MM.yyyy HH:mm'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy HH:mm'"));
	Запись.Основание 			= Запись.ТемаПисьма;
	
	Запись.ТекстПисьма			= Запись.ТемаПисьма;
	
	Запись.СписокПолучателей	= СтрСоединить(Получатели, "##");
	
	Запись.Записать();
КонецФункции //СоздатьПисьмо_НетОшибок(ИмяЛога, ПериодС, ПериодПо, Получатели)

ИмяЛогаРассылок = "РассылкаОшибокЛогов";
